# Пользователь вводит 3 числа. Каждое число - это длина стороны треугольника. Нужно вывести, является ли треугольник равносторонним, равнобедренным или общего вида
#
# Пример входных данных 1:
# 3, 3, 3
# Пример выходных данных 1:
# Равносторонний треугольник
#
# Пример входных данных 2:
# 2, 3, 3
# Пример выходных данных 2:
# Равнобедренный треугольник
#
# Пример входных данных 3:
# 2, 3, 4
# Пример выходных данных 3:
# Треугольник общего вида

def solve():
    pass


if __name__ == '__main__':
    solve()