# Пользователь вводит 4 числа. Вывести их в порядке возрастания
#
# Пример входных данных 1:
# 1, 2, 3, 4
# Пример выходных данных 1:
# 1, 2, 3, 4
#
# Пример входных данных 2:
# 4, 3, 2, 1
# Пример выходных данных 2:
# 1, 2, 3, 4
#
# Пример входных данных 3:
# 1, 5, 3, 1
# Пример выходных данных 3:
# 1, 1, 3, 5
#
# Пример входных данных 4:
# 23, 5, 24, 1
# Пример выходных данных 4:
# 1, 5, 23, 24
#
# Пример входных данных 5:
# 1, 4, 3, 2
# Пример выходных данных 5:
# 1, 2, 3, 4

def solve():
    pass


if __name__ == '__main__':
    solve()