# Пользователь вводит 2 числа: координаты x и y точки. 
# Нужно проверить, лежит ли точка внутри области, ограниченной четырьмя прямыми.
# 1. x = 1 - левая граница
# 2. x = 5 - правая граница
# 3. у = x - нижняя граница
# 4. y = 2x + 5 - верхняя граница
# Если точка лежит внутри этой области, вывести "Точка находится внутри области", иначе вывести "Точка находится вне области"
#
# Пример входных данных 1:
# 1 1
# Пример выходных данных 1:
# Точка находится вне области
#
# Пример входных данных 2:
# 2 3
# Пример выходных данных 2:
# Точка находится внутри области
#
# Пример входных данных 3:
# 3 12
# Пример выходных данных 3:
# Точка находится вне области
#
# Пример входных данных 4:
# 3 10
# Пример выходных данных 4:
# Точка находится внутри области

def solve():
    pass


if __name__ == '__main__':
    solve()