# Пользователь вводит 6 чисел. Вывести минимальное и максимальное из введенных чисел
#
# Пример входных данных 1:
# 1, 2, 3, 4, 5, 6
# Пример выходных данных 1:
# 1, 6
#
# Пример входных данных 2:
# 6, 5, 4, 3, 2, 1
# Пример выходных данных 2:
# 1, 6
#
# Пример входных данных 3:
# 1, 5, 3, 1, 26, 0
# Пример выходных данных 3:
# 0, 26
#
# Пример входных данных 4:
# 23, 1, 24, 1, 2
# Пример выходных данных 4:
# 1, 24
#
# Пример входных данных 5:
# 1, 4, 7, 1, 7, 3
# Пример выходных данных 5:
# 1, 7

def solve():
    pass


if __name__ == '__main__':
    solve()